<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Автомобілі</title>
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.3.0-alpha3/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-KK94CHFLLe+nY2dmCWGMq91rCGa5gtU4mk92HdvYe+M/SXH301p5ILy+dN9+nJOZ" crossorigin="anonymous">
<style>
    img{
        width: 100%;
    }
</style>
</head>
<body>
    <nav class="navbar navbar-expand-lg bg-body-tertiary">
        <div class="container-fluid">
          <a class="nav-link" href="Автомобілі.html">
            <h4>
                        Автомобілі
            </h4>
                      </a>
          <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
            <span class="navbar-toggler-icon"></span>
          </button>
          <div class="collapse navbar-collapse" id="navbarSupportedContent">
            <ul class="navbar-nav me-auto mb-2 mb-lg-0">
              <li class="nav-item">
                <a class="nav-link" href="Автомобілі Енциклопедія.html">S-клас</a>
              </li>
              <li class="nav-item">
                <a class="nav-link" href="Автомобілі Енциклопедія J.html">
                  
                  J-клас

                </a>
              </li>
              <li class="nav-item">
                <a class="nav-link" href="Автомобілі Енциклопедія E.html">

                  E-клас

                </a>

              </li>
              <li class="nav-item">
                <li class="nav-item">
                  <a class="nav-link" href="Автомобілі Енциклопедія F.html">F-клас</a>
                </li>
              </li>
              <li class="nav-item">
                <a class="nav-link" href="Автомобілі Енциклопедія B.html">B-клас</a>
              </li>
              <li class="nav-item">
                <a class="nav-link" href="Автомобілі Енциклопедія C.html">C-клас</a>
              </li>
              <li class="nav-item">
                <a class="nav-link" href="Автомобілі Енциклопедія D.html">D-клас</a>
              </li>
            </ul>
            
          </div>
        </div>
      </nav>
      <div class="container">
        <div class="row">
            <div class="col-md-6">
<h1>
    Про мене
</h1>
<p>
    Мене звати Єгор мені 10 років і я вчусь робити веб-сайти.
</p>
            </div>
            <div class="col-md-6">
                <h1>
Опис сайту
                </h1>
                <p>
На моєму веб-сайті ти зможеш подивитись фото, технічні характерестики автомобілів різних марок, класів. 
                </p>
                
            </div>
        </div>
      </div>
      <div class="container">
        <div class="row">
            <div class="col-md-12">
                <h1>
                    S клас
                </h1>
                <p>
                    S-клас S - від слова "спорт". Під цей клас підпадають будь-які спортивні (звичайно, не в гоночному сенсі) купе.
                </p>
                <p>
                    Переможець перших автомобільний перегонів в 1894 році є Pegeot 3hp. він і є одним з найперших автомобілів S класу.
                </p>
                <p>
                    Сучасним представником автомобілів S класу є Koenigsegg Regera. Він часто згадується в таких відеоіграх як need for speed payback, forza horizon 5, need for speed heat та в інших. Його максимальна швидкість становить 410 км/год
                </p>
                <p>
                    Є відомості що Toyota хоче зробити нову модель GR або Gazoo Racing Про неї зараз нічого не відомо. Але Toyota вирішили інвестувати кошти в електромобілі.
                </p>
                <img src="ARS.jpeg" alt="">
            </div>
            <div class="col-md-12">
                <h1>
                    J клас
                </h1>
                <p>
                 J-клас  — категорія в європейській класифікації легкових автомобілів, яка описується як «позашляховики (включаючи кросовери та SUV)» Вона охоплює широку категорію автомобілів, починаючи від кросоверів (на платформі легкових автомобілів), SUV (на основі платформи легких вантажівок) та позашляховиків.   
                </p>
                <p>
                    Першим повнопривідним авто є Lohner-Porsche його зробив Фердинанд Порше на початку минулого століття.
                </p>
                <p>
                    Сучасним придставником автомобілів J класу є Tesla Model X. Це щось між електромобілем і кросовером. Але його швидкості достатньо щоб обігнати на асфальті деяких автомобілів S класу.
                </p>
                <p>
                В 2024 році вийде новий Volvo EX90. Немає сумнівів що він вийде, тому що Volvo його робить вже.
                </p>
                <img src="CE.avif" alt="">
            </div>
            <div class="col-md-12">
                <h1>
E клас
                </h1>
                <p>
                    E-клас або Сегмент E клас легкових автомобілів згідно з класифікацією Європейської комісії, другий за величиною габариту з класів автомобілів, відповідає бізнес-класу. У 2017 році частка продажу машин E-класу складала 3% від європейського ринку.
                </p>
                <p>
                    В 1899 році був придставлений Mercedes Sprinter він і був одним з найперших автомобілів бізнес класу
                </p>
                <p>
                    Сучасним представником автомобілів бізнес класу є BMW 5 series. У ньому 286 к. с. 
                </p>
                <p>
                    Майбутнім представником автомобілів бізнес класу є також BMW(BMW I5). Можливо ви знаєте такі електромобілі як BMW I3 та BMW I8. Так як BMW I5 починається теж з I, можна впевнено сказати що це буде електромобіль.
                </p>
                <img src="JX.jpg" alt="">
            </div>
            <div class="col-md-12">
                <h1>
F клас
                </h1>
                <p>
                    F-клас є найбільшим в європейській класифікації легкових автомобілів і завжди описується як "люкс-автомобіль". Еквівалентними категоріями є повнорозмірні люкс-автомобілі у Сполучених Штатах та люкс-лімузини у Сполученому Королівстві.                </p>
                    <p>
                        Одним з найперших lux автомобілем є Rollce-Royce 10hp 1904 року. У нього був 2-циліндровий двигун що для того часу було ідеально.
                    </p>
                    <p>
                        Сучасним прикладом автомобілів класу люкс є електромобіль Tesla Model S. 1020 к. с. у нього, а це більше ніж у деяких авто за мільйони долларів, а сам коштує до 200 тисяч.  
                    </p>
                    <p>
                        Майбутнім придставником автомобілів люкс класу є Bentley Mulliner Batur. У Batur двигун W12. Але таких машин на буде тільки 18.
                    </p>
                <img src="LL.webp" alt="">
            </div>
            <div class="col-md-12">
                <h1>
B клас
                </h1>
                <p>
                    Дані автомобілі також називають "Medium Cars", "Гольф-клас". Це машини середніх розмірів (довжина до 4,5 метрів) з кузовами типу седан або хетчбек, здатні комфортно розмістити в салоні до 5 пасажирів. У поєднанні із збільшеним об'ємом багажних відділень, це робить їх найуніверсальнішими автомобілями.
Також потрібно сказати, що машини C-класу все ще відносяться до бюджетних.          
<p>
Перший мініатюрний автомобіль Fiat Topolino розрахований на 2 людей витрачав він 6 л на 100 км. Виробляли Topolino в 1936-1955 роки в Італії. 
</p>
<p>
    Одним з сучаснх маленьких машин є Mini Cooper S, у ньому автоматична коробка передач та електро двигун. 
</p>
<p>
Приклад майбутнього маленького авто City Transformer 1 що розшифровується як "місцевий трансформер". Трансформером він зветься тому що вміе регулювати свою ширину за допомогою колес трансформерів.
</p>
      <img src="MCO.jpg" alt="">
            </div>
            <div class="col-md-12">
                <h1>
C клас
                </h1>
                <p>
                    C-клас є третім найменшим в європейській класифікації легкових автомобілів, який описується як "середні автомобілі". Це еквівалентно категорії "малий сімейний автомобіль" у Euro NCAP, і категорії компактних автомобілів у Сполучених Штатах і Великій Британії. У 2011 році C-клас мав частку європейського ринку в 23%      
                    <p>
                        Першим авто середнього класу був Ford Model T випущений 1908 року.

                    </p>
                    <p>
                        Прикладом сучасних авто середнього класу є Subaru Impreza, з коробкой передач варіатор, двигуном 2 л, повним приводом.
                    </p>          
                    <img src="MLE.jpg" alt="">
            </div>
            <div class="col-md-12">
                <h1>
D клас
                </h1>
                <p>
                    D-клас є третім найбільшим в європейській класифікації легкових автомобілів, який описується як «великі автомобілі». Це еквівалентно категорії «великий сімейний автомобіль» у Euro NCAP, і сучасним визначенням категорії «середньорозмірний автомобіль», які використовуються в Північній Америці          
                    <p>
                        Старшим прикладом виликих автомобілів є GAZ M1, потужністю 40-50 к. с., максимальна швидкість якого становила 105 км/год, рік випуску його був 1936.
                    </p>      
                    <p>
                        Сучасним прикладом авто D класу є Hyndai Sonata, сімейний автомобіль у якого під капотом 180 к. с.. 
                    </p>
                    <p>
                       Pegeot планує зробити новий автомобіль D класу (можливо D класу) Pegeot Inception Розгін до 100 км/год триває менше 3 секунд а потужність до 680 к. с..
                    </p>
                    <img src="SSS.jpg" alt="">
            </div>
        </div>
      </div>
<div class="container">
    <div class="row">
        <div class="col-md-8">
            <h1>
Вибери клас
            </h1>
            <p>
                Клас ти можеш вибирати зверху просто натисни "на верх" потім натисни на клас автомобіля який хочеш вибрати 
            </p>
            
        </div>
        <div class="col-md-4">
            <a href="Автомобілі.html">
                <button>
                    На верх
                </button>
            </a>
        </div>
    </div>
</div>
    <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.3.0-alpha3/dist/js/bootstrap.bundle.min.js" integrity="sha384-ENjdO4Dr2bkBIFxQpeoTz1HIcje39Wm4jDKdf19U8gI4ddQ3GYNS7NTKfAdVQSZe" crossorigin="anonymous"></script>

</body>
</html>
